In [1]:
import pandas as pd

In [2]:
df =  pd.read_csv('final_output.csv')

In [3]:
df.head()

,cvr_nummer,navn,kommune_navn,antal_ansatte
0,15754176,Slagelse Erhvervsforening Team Slagelse,SLAGELSE,2.0
1,41447281,Grundejerforeningen Hyllerupvej,SLAGELSE,NaN
2,32331203,NETTOTELT ApS,SLAGELSE,1.0
3,26476208,Handelsby.dk v/Brian M. L...,SLAGELSE,0.0
4,34232261,Gravstenen.dk v/Thomas Worm Hansen,SLAGELSE,0.0

In [7]:
sum(df.duplicated()) - df.shape[0]

-3004

In [8]:
df_2 = pd.read_csv('final_2_output.csv')

In [9]:
df_2.head()

,cvr_nummer,navn,kommune_navn,antal_ansatte
0,15754176,Slagelse Erhvervsforening Team Slagelse,SLAGELSE,2.0
1,41447281,Grundejerforeningen Hyllerupvej,SLAGELSE,NaN
2,32331203,NETTOTELT ApS,SLAGELSE,1.0
3,26476208,Handelsby.dk v/Brian M. L...,SLAGELSE,0.0
4,34232261,Gravstenen.dk v/Thomas Worm Hansen,SLAGELSE,0.0

In [10]:
df_2.shape

(152000, 4)

In [11]:
sum(df_2.duplicated()) - df_2.shape[0]

-3004